{"pageProps":{"post":{"slug":"cdns-a-deep-dive","content":"<h3>CDNs — A Deep Dive</h3>\n<h4>You’ve used them before but you’re not completely sure what they are, here are some answers.</h4>\n<p><img src=\"/content/blog/cdns-a-deep-dive/images/0.png\" alt=\"\"></p>\n<p>Single server versus Content Delivery Network (CDN) by <a href=\"https://en.wikipedia.org/wiki/File:NCDN_-_CDN.png\">Kanoha</a> on Wikimedia Commons</p>\n<h3>What is a CDN?</h3>\n<p>A **Content Distribution **(or Delivery) **Network **(<strong>CDN</strong>) is a group of servers distributed geographically with the purpose of providing fast delivery of Internet content.</p>\n<p>The CDN's servers act as reverse proxies for your origin servers, where the content is hosted.</p>\n<p>Servers are contained in facilities called <strong>Points of Presence</strong> (<strong>PoP</strong>), which are spread around the globe.</p>\n<h3>How does a CDN work?</h3>\n<p>Servers in a CDN can help provide a better user experience by caching content closer to the user and delivering it instead of the origin server.</p>\n<p>This reduces the <strong>Round Trip Time (RTT)</strong> which is the number of milliseconds (ms) it takes for a browser to send a request and receive a response back from a server.</p>\n<p><img src=\"/content/blog/cdns-a-deep-dive/images/1.png\" alt=\"\"></p>\n<p>Without CDN vs with CDN by <a href=\"https://www.imperva.com/learn/performance/what-is-cdn-how-it-works/\">Imperva</a></p>\n<h4><strong>Without CDN</strong></h4>\n<ol>\n<li>A user in Barcelona, Spain opens her browser and navigates to <a href=\"http://example.com/\">http://example.com/</a>. The browser does an HTTP request <code>GET http://example.com/index.html</code></li>\n<li>The website is hosted on a server based in Boston, United States, so the request has to travel across the Atlantic ocean and be processed by the origin server. Then, the server’s response has to travel back to Barcelona.</li>\n<li>This causes a <strong>high RTT</strong> and a <strong>suboptimal UX</strong>.</li>\n</ol>\n<h4><strong>With CDN</strong></h4>\n<ol>\n<li>A user in Barcelona, Spain opens her browser and navigates to <a href=\"http://example.com/\">http://example.com/</a>. The browser does an HTTP request <code>GET http://example.com/index.html</code></li>\n<li>When a user requests an asset, the DNS routes the request to the best performing PoP location, which usually is the geographically closest one to the client.</li>\n</ol>\n<p>At this point, there are 2 possible outcomes:</p>\n<ul>\n<li><strong>The asset is available:</strong> A non-stale copy of the requested asset is present in the PoP’s cache servers, so the asset is sent back to the user directly, resulting in a <strong>shorter RTT</strong>, hence a better UX.</li>\n<li><strong>The asset is NOT available</strong>: The PoP’s server re-routes the request to the origin server, which sends back a fresh version of the asset. The PoP’s server caches the asset and sends it back to the user. This time the RTT is longer but subsequent requests for this asset in this region will be faster since the asset is now available in the PoP’s cache servers.</li>\n</ul>\n<p>The asset remains cached on the PoP’s cache server until the <strong>time-to-live (TTL)</strong> specified by its HTTP headers expires.</p>\n<h3>Pros/cons of using a CDN?</h3>\n<p>The most obvious benefit is the **better UX **caused by the **faster RTT **that comes with using cached content in proximity to the user.</p>\n<p>Beyond that, using a CDN can result in <strong>increased uptime</strong> on a website. Imagine a traffic overload or a hardware failure that incapacitates your origin server. Having cached content on the distributed CDN’s servers can prevent interruptions on the service for end-users. Moreover, since the content is redundant in the CDN’s servers, a failure in one PoP can be saved by the content on another PoP.</p>\n<p>Another benefit is that by serving cached content, <strong>bandwidth costs on the origin server are reduced</strong>. However, the CDN provider might charge a substantial fee, making this benefit tiny, so take this point <em>with a grain of salt</em>!</p>\n<p>Also, it is worth noting that some CDN providers, by leveraging the reverse proxy configuration, are crossing to other services. Some use the CDNs distributed configuration to provide <strong>protection againstDistributed Denial of Service(DDOS) attacks</strong>. Also, they may implement load balancers to avoid overloading origin servers with huge amounts of traffic.</p>\n<h3>Which types of CDNs exist?</h3>\n<p>At the time of writing, there are 6 major types of CDN:</p>\n<ul>\n<li><strong>Free</strong> CDNs, whose task is to serve open source packages. E.g. jsDelivr.</li>\n<li><strong>Commercial</strong> CDNs, provide their services to the public at a cost. E.g. Cloudflare.</li>\n<li>**In-House **CDNs, launched by companies whose business model makes commercial CDN options not worth their costs, so they roll out their own private CDN. E.g. Netflix.</li>\n<li>**Telco **CDNs, launched by Telecommunications Service Providers (TSPs) in order to serve their own streaming content without leasing commercial CDNs. They’re similar to In-Hose CDNs. E.g. Verizon.</li>\n<li><strong>Peer to Peer</strong> (P2P) CDNs, used to share assets between individuals who are equally privileged in the application, or peers. E.g. BitTorrent.</li>\n<li><strong>Multi</strong> CDNs, leverage the power of several other CDNs. E.g. MetaCDN.</li>\n</ul>\n<h3>Why don’t CDNs come by default in web hosting?</h3>\n<p>When CDNs were starting to appear in the late 90s, they were really expensive so not all organizations could afford them.</p>\n<p>Nowadays, the reductions in cost have made CDNs a more accessible option, and many hosting providers actually offer CDN services as a checkbox add-on.</p>\n<h3>Thanks for reading!</h3>\n<p>Hope you found it interesting. If you want to learn more, you can find the resources I used to research this topic in the next section. The Imperva one is really well explained.</p>\n<p>Keep learning, and have a good day!</p>\n<p>Jon Portella</p>\n<hr>\n<h3>Resources</h3>\n<p><a href=\"https://en.wikipedia.org/wiki/Content_delivery_network\">Content delivery network — Wikipedia</a></p>\n<p><a href=\"https://www.cloudflare.com/learning/cdn/what-is-a-cdn/\">What is a CDN? | How do CDNs work? — Cloudflare</a></p>\n<p><a href=\"https://docs.microsoft.com/en-us/azure/cdn/cdn-overview\">What is a content delivery network (CDN)? — Azure</a></p>\n<p><a href=\"https://www.imperva.com/learn/performance/what-is-cdn-how-it-works/\">What is a CDN? How does a CDN Work? — Imperva</a></p>\n<p><a href=\"https://www.imperva.com/learn/performance/cdn-architecture\">CDN Infrastructure Architecture and Topology — Imperva</a></p>\n<p><a href=\"https://www.keycdn.com/support/what-is-a-multi-cdn\">What Is a Multi CDN? — KeyCDN</a></p>\n","frontmatter":{"title":"CDNs — A Deep Dive","spoiler":"You’ve used them before but you’re not completely sure what they are, here are some answers.","date":"2021-04-21T23:45:16.803Z"}},"previous":{"slug":"ombd-14-how-to-call-a-function-when-a-user-stops-typing","frontmatter":{"title":"How To Call a Function When a User Stops Typing","spoiler":"We’ll learn how to implement a browser auto-saving draft system in JavaScript","date":"2021-04-21T13:12:45.974Z"}},"next":{"slug":"running-code-snippets-on-chrome-s-console-2","frontmatter":{"title":"Running Code Snippets on Chrome's Console","spoiler":"Learn how to store and run JavaScript code snippets in Chrome's DevTools for faster testing and debugging.","date":"2021-04-23T13:58:02.393Z"}}},"__N_SSG":true}