{"pageProps":{"post":{"slug":"the-ugliest-6-reasons-to-not-enrol-in-a-coding-bootcamp","content":"<h3>The Ugliest 6 Reasons To Not Enroll In A Coding Boot Camp</h3>\n<h4>Here’s my experience as a top European coding boot camp graduate</h4>\n<p><img src=\"/content/blog/the-ugliest-6-reasons-to-not-enrol-in-a-coding-bootcamp/images/0.png\" alt=\"\"></p>\n<p>Illustration by <a href=\"https://www.instagram.com/loornicolas/\">loornicolas</a></p>\n<p>There are some ugly partsof coding boot camps that people don’t talk about.</p>\n<p>In this article, I’m going to give you a global vision about the possible dangers of enrolling in these courses, with the objective ofhelping you decide whether to do a boot camp or not.</p>\n<p>About me — Two years ago graduated from <a href=\"https://codeworks.me/\">Codeworks</a>, which is currently the <a href=\"https://www.switchup.org/rankings/best-coding-bootcamps\">top 5 best valued Software Engineering boot camp in the world</a>. It was a great experience for me. And besides the software developer job that I landed shortly after graduating from the course, once a week I’m also teaching new software devs in that same boot camp as an instructor.</p>\n<p>This experience has shown me some of the dangers of coding boot camps from several perspectives, both as a student and as an instructor. Those that don’t appear in promo material:</p>\n<hr>\n<h3>1. There’s just too much info to take in such a short time</h3>\n<p>In three months you are expected from going to knowing nothing in computer science to being familiar with JavaScript, HTML, CSS, data structures, algorithms, Git, web servers, databases, ORMs, web security… and that’s just to name a few.</p>\n<p>The worst part is that it seems that you can never keep up with the new concepts, so some students break down.</p>\n<p>However, in my experience, I didn’t fully understand all the concepts as they were being thrown to me, but I kept pushing and everything fell into place by the end of the course. Seems counterintuitive, but the knowledge gap starts closing after the course, and when you start working.</p>\n<hr>\n<h3>2. Drop Outs — People that don’t make it</h3>\n<p>I’ve seen a couple in these two years but is not common. Generally, if you get admitted to the course — and that’s a big if — you are capable of completing it.</p>\n<p>The special cases of people dropping out are usually related to feeling too overwhelmed or not putting in enough effort. So, related to the previous point, pushing forwards to the end of the course makes everything fit into place afterward.</p>\n<hr>\n<h3>3. Completing the course doesn’t give you enough experienced to land a job</h3>\n<p>While it’s true that graduates still have some big knowledge gaps, most of the practical skills required to work as a junior dev are learned. It just needs some time working to be assimilated.</p>\n<p>Your employer will generally understand this and won’t give you mission-critical assignments in your first months as a developer.</p>\n<p>Moreover, after graduating, you have all the dormant knowledge and all the potential to kick off your software career. Companies usually embrace this fact, since they see it as an investment opportunity to make you grow following their practices.</p>\n<hr>\n<h3>4. They’re just too expensive</h3>\n<p>That’s a fact. Around 10k for three months.</p>\n<p>On the other hand, the average yearly salary for a software dev in the US is ~76k, so it really is an investment in yourself.</p>\n<hr>\n<h3>5. It’s not comparable to Software Engineering in a University</h3>\n<p>Usually, boot camps aren’t regulated as a traditional superior studies center, such as universities. So it’s not a “formal” title.</p>\n<p>This point can scare off some people. However, in my experience, the number of potential employers that have asked me for a formal university title is <strong>none</strong>.</p>\n<p>Companies don’t really care about titles, generally, they care about your skills and you being able to get your work done. And, for a software developer, that’s easily put under test with live coding interviews and take-home assignments.</p>\n<hr>\n<h3>6. There won’t be enough jobs soon</h3>\n<p>While it’s true that there is a big demand for software developers right now, having boot camps put out in the market by dozens of juniors developers every month will make it more difficult to find a job soon.</p>\n<p>However, I think this is still long from happening. At the moment, every company is a software company or requires software services of some kind, so demand is enormous.</p>\n<p>Besides, graduating from the boot camp is only the first step, afterwards, you’ll keep on learning, specializing, and finding your niche. For me, it was just the first step in the tech business.</p>\n<hr>\n<h3>— In Short</h3>\n<p>Before deciding to enroll in a software engineering boot camp, mind all the possible outcomes.</p>\n<p><strong>If you put effort and interest, it’s absolutely doable</strong>. In my experience, one of the best decisions I made. However, every person is different.</p>\n<hr>\n","frontmatter":{"title":"The Ugliest 6 Reasons To Not Enrol In A Coding Bootcamp.","spoiler":"There are some ugly parts that people don’t talk about. Before deciding to enrol, mind all the possible outcomes.","date":"2020-10-02T10:03:34.981Z"}},"previous":{"slug":"how-i-doubled-my-income-in-3-months","frontmatter":{"title":"How I Doubled My Income in 3 Months","spoiler":"The story of my career change, and how first choices aren’t usually the best for your future","date":"2020-09-30T00:00:00.284Z"}},"next":{"slug":"using-java-script-to-test-browser-support-for-a-css-pseudo-class","frontmatter":{"title":"Using JavaScript To Test Browser Support for a CSS Pseudo-Class","spoiler":"An obscure (but effective) way to do CSS feature detection with JavaScript. In the example, we test for a feature that only Microsoft browsers have.","date":"2021-02-23T13:47:47.254Z"}}},"__N_SSG":true}