{"pageProps":{"post":{"slug":"1-minute-to-become-a-better-developer-17","content":"<h3>Forward Proxy vs. Reverse Proxy: OMBD #17</h3>\n<h4>Despite having similar names, they serve different purposes. Here’s a quick guide.</h4>\n<p><img src=\"/jon-portella-blog/content/blog/1-minute-to-become-a-better-developer-17/images/0.png\" alt=\"\"></p>\n<p>Art by my buddy<a href=\"https://www.instagram.com/loornicolas/\"> Loor Nicolas</a></p>\n<hr>\n<p>I came across <a href=\"https://www.cloudflare.com/es-es/learning/cdn/glossary/reverse-proxy/\">this really well-explained article from Cloudflare</a> about proxies and wanted to share it with you, in one minute.</p>\n<h4>Proxy Server, AKA “Forward Proxy” or just “Proxy”</h4>\n<p>A server that sits in front of the client and acts as a middleman. It intercepts the client requests and <strong>forwards</strong> them — hence, the name — on their behalf to another server somewhere on the Internet.</p>\n<p><img src=\"/jon-portella-blog/content/blog/1-minute-to-become-a-better-developer-17/images/1.png\" alt=\"\"></p>\n<p>Forward Proxy Flow, image by <a href=\"https://www.cloudflare.com/\">Cloudflare</a>.</p>\n<p>Some use cases of a Forward Proxy:</p>\n<ul>\n<li><strong>Block access to certain content</strong>. A workplace network might be configured to connect through a proxy, which blocks requests to social media websites.</li>\n<li><strong>Avoid state or institutional regulations</strong>. The opposite to the previous example: If your network blocks connections to certain websites, you can do the requests to a proxy outside of that network which will forward the request for you.</li>\n<li><strong>Hide the client’s identity</strong>. By connecting to a website through a proxy, you could make your IP address more difficult to trace, since the final server would receive the proxy’s IP address.</li>\n</ul>\n<p>If you want to put it into practice, I wrote a story about the subject, covering the last 2 use cases:</p>\n<p><a href=\"https://jportella93.medium.com/1-minute-to-become-a-better-developer-10-bcb2396b6246\">**1 Minute To Become A Better Developer (#10)***Learn how to change public your public IP address, in one minute.*jportella93.medium.com</a><a href=\"https://jportella93.medium.com/1-minute-to-become-a-better-developer-10-bcb2396b6246\"></a></p>\n<h4>Reverse Proxy</h4>\n<p>Is a server that sits in front of one or more web servers and acts as a gatekeeper for incoming requests.</p>\n<p><img src=\"/jon-portella-blog/content/blog/1-minute-to-become-a-better-developer-17/images/2.png\" alt=\"\"></p>\n<p>Reverse Proxy Flow, image by <a href=\"https://www.cloudflare.com/\">Cloudflare</a>.</p>\n<p>Some use cases of a Reverse Proxy:</p>\n<ul>\n<li><strong>Load Balancing</strong>. A Reverse Proxy can distribute incoming requests to available servers to ensure the most efficient handling.</li>\n<li><strong>Global Server Load Balancing</strong>. If we have servers in several parts of the world, our Reverse Proxy can forward the client’s request to its closest server, ensuring faster response times.</li>\n<li><strong>Content Caching</strong>. By distributing proxies in several parts of the world, we can cache content to achieve faster responses. The first request from a different country will be forwarded to the actual server, but subsequent requests from that country will be quickly answered with the cached content on the local reverse proxy.</li>\n<li><strong>Protection from Targeted Attacks</strong>. By using a Reverse Proxy, the IP of our final server is never revealed, making it harder for attackers to target them with attacks such as DDoS attacks.</li>\n<li><strong>Efficient encryption</strong>. Instead of handling computationally expensive encryptions and decryptions from our server, we can delegate that task to the reverse proxy.</li>\n</ul>\n<hr>\n","frontmatter":{"title":"Forward Proxy vs. Reverse Proxy: OMBD #17","spoiler":"1 Minute To Become A Better Developer (#17)","date":"2021-03-17T13:47:39.957Z"}},"previous":{"slug":"1-minute-to-become-a-better-developer-16","frontmatter":{"title":"1 Minute To Become A Better Developer (#16)","spoiler":"Learn to avoid headaches with Static Code Analysis Tools, in one minute.","date":"2021-03-16T13:44:11.170Z"}},"next":{"slug":"1-minute-to-become-a-better-developer-18","frontmatter":{"title":"1 Minute To Become A Better Developer (#18)","spoiler":"Learn how to avoid hyphen line-breaks, in one minute.","date":"2021-03-18T14:27:15.879Z"}}},"__N_SSG":true}