{"pageProps":{"post":{"slug":"how-i-doubled-my-income-in-3-months","content":"<p><img src=\"./images/hand.jpeg\" alt=\"\"></p>\n<h2>The Beginning — My Old Job</h2>\n<p>Barcelona, 2018.</p>\n<p>I was working as a live audiovisual technician in events like shows and conferences. It was my first serious job that I landed after graduating of my Audiovisual Communications degree.</p>\n<p>I didn’t quite like it because the working hours were terrible so I couldn’t really have a social life out of work. Moreover, the senior employees in the company didn’t seem very happy with their situation either.</p>\n<p>So <strong>there wasn’t a nice future for me</strong> by doing that.</p>\n<p>After a very intense project, I decided to quit the job. I didn’t have a plan B, I just knew I had to stop it cold turkey before finding something else— Impulses are my thing.</p>\n<h2>The Search — A Better Future</h2>\n<p>I was in my mid-twenties and the most logical step after my degree in Audiovisual Communications was to do some master’s degree.</p>\n<p>After some research, it seemed like <strong>every master's degree cost around 10k</strong>. I thought it was a fair price if that was going to land me with a better-paying job, but <strong>the ratios of graduated to employed were pretty low</strong>. Besides, the skills they taught didn’t seem that useful and I wasn’t really interested in them.</p>\n<h2>First Idea — Masters Degree in Digital Marketing</h2>\n<p>In the end, as it seemed I had to pick something and I always was an Internet-friendly person, I picked a Masters's Degree in Digital Marketing.</p>\n<p>However, before actually enrolling, I asked a friend who was working as a digital marketer at the time. In hindsight, that is the best thing I did in a long time.</p>\n<p>She told me <strong>that was a really bad idea</strong> since she knew me and my profile was none as it was expected for the job. I’d have hated every moment of it.</p>\n<h2>Second Idea — Software Engineering Bootcamp</h2>\n<p>However, she gave me the idea to enroll in a Software Engineering boot camp. I didn’t really understand that, since <strong>I hadn’t any engineering or coding experience.</strong></p>\n<p>She said that a person from her company did it and now was working as a developer and that I would probably be able to do it too. That was 3 intense months of study but, after that, <strong>it was easy to land a good-paying job</strong>.</p>\n<h2>Choosing a Bootcamp</h2>\n<p>I decided on the boot camp and started comparing. I was looking for something in the Barcelona area. There were many options but in the end, I boiled it down to two: <a href=\"https://www.ironhack.com/\">Ironhack</a> or <a href=\"https://codeworks.me/\">Codeworks</a>.</p>\n<p>Both of them would <strong>take me around 3 months to complete</strong>, but Ironhack was substantially more economic. On the other hand, Codeworks seem to be much more in-depth. Also, despite being a 10k investment, <strong>their graduate-to-employee ratio was unbeatable</strong>. So I decided to pick Codeworks and booked an appointment for an intro interview.</p>\n<h2>The Selection Process — Part 1. The test</h2>\n<p>The process consisted of a one-hour coding test in the boot camp premises and a coding assignment to take home and complete in a week. After setting a date for the test, they pointed me to some free online resources about HTML, CSS, and JavaScript to prepare for the test.</p>\n<p>I learned an immensely high amount of concepts in a short time only by going through those online resources to prepare for the test. <strong>I hadn’t learned that much since university.</strong></p>\n<p>On the day of the test, while I was getting to the office, I was very nervous. The test consisted of resolving a set of simple JavaScript algorithms in a computer next to an instructor. Despite being shaky, I did it correctly and passed the test.</p>\n<h2>The Selection Process — Part 2. The assignment</h2>\n<p>Now it was time for the take-home assignment. The instructor let me chose between 3 projects and I — completely dedicated to this new path — took the most difficult one: building a BlackJack game.</p>\n<p>I was working on the assignment for the whole week. I became an expert in searching Google and Stack Overflow for problems that appeared in my code and, in the end, <strong>I achieved <a href=\"https://jportella93.github.io/Blackjack/index.html\">a very decent BlackJack game</a> that impressed the reviewers</strong>.</p>\n<h2>The Pre-Course</h2>\n<p>After this, I paid a part of the tuition and received my pre-course resources, which consisted of 3 very complex exercises which I had to finish in order to get admitted to the boot camp.</p>\n<p>These were <strong>really difficult</strong>. It touched very complex JavaScript concepts which many professional developers don’t really know. However, after 2 intense weeks, I finished them and was ready to start the course!</p>\n<h2>The Course</h2>\n<p>I started in the April batch. In my batch, there were 13 more people from around the world who also were aspiring Software Developers.</p>\n<p><strong>Those were 3 intense months</strong>. We were on campus from Monday to Saturday, from 8.30 am to 9 pm. And sometimes we’d also go on Sunday to recover topics.</p>\n<p>It was hands-down <strong>the most intense learning experience I had</strong>. We went in-depth over every topic related to working as a Software Developer. When we were about to master a concept, we were already starting with the next one. There was virtually no time to get bored, it was frenetic. The instructors <strong>were very good</strong> and helped us when we got stuck.</p>\n<p>After the first half of the course learning and solidifying all the topics. There was the second half, where we build 3 web applications from the ground up. <strong>These proved invaluable for the job search</strong>. Finally, in the last part of the course, we spend some time focusing in how to get a good developer job and how to ace interviews.</p>\n<h2>My Post-Bootcamp Job</h2>\n<p>As soon as I finished the boot camp, my job became finding a job. I spent several hours a day going through LinkedIn and other job boards, contacting recruiters, and doing tests. I made a spreadsheet with all the companies I had applied to, the contact person, and the state of the selection process.</p>\n<p><strong>Three weeks after graduating</strong>, after several interviews, I found a company that seemed really interesting, <a href=\"https://n1-headache.com/\">Curelator N1-Headache</a>. Their mission is to help people suffering from migraine to control them by using an individualized analytical approach. I had a couple of meetings with the company and decided it was a good place to start my career as Software Developer, <strong>I got hired</strong>.</p>\n<p>The best part was that <strong>I recovered my boot camp investment in 3 months.</strong></p>\n<h2>Two Years Later</h2>\n<p>I’m still in the same company, currently as a Front-End Engineer. <strong>I have an important role over most products in the company</strong>. Besides, I’ve learned a number of skills and keep doing so every day.</p>\n<p>Also, one day a week, I’m <strong>forming new Software developers</strong> in the boot camp where I learned everything on this subject. Recently, <a href=\"https://www.switchup.org/rankings/best-coding-bootcamps\">the boot camp raised to the top five best Software Engineering boot camps in the whole world</a>.</p>\n<p>I usually work remotely. And <strong>both of my jobs haven’t been affected a bit by the COVID19 situation</strong>.</p>\n<h2>Bottom Line</h2>\n<p>When I see social media posts of my ex-coworkers complaining about how since the COVID19 crisis there are no jobs, I confirm that <strong>following my gut and leaving that company was the best decision ever.</strong></p>\n<p>So don’t be afraid to reinvent yourself. <strong>If you fancy a change… go for it!</strong></p>\n","frontmatter":{"title":"How I Doubled My Income in 3 Months","spoiler":"The story of my career change, and how first choices aren’t usually the best for your future","date":"2020-09-30T00:00:00.284Z"}},"previous":{"slug":"5-remarkable-git-commands-that-will-boost-your-coding-productivity","frontmatter":{"title":"5 Remarkable Git Commands That Will Boost Your Coding Productivity","spoiler":"These are custom made, they don’t appear in the Git docs! Saved me countless headaches in the last two years…","date":"2020-09-29T08:24:58.322Z"}},"next":{"slug":"the-ugliest-6-reasons-to-not-enrol-in-a-coding-bootcamp","frontmatter":{"title":"The Ugliest 6 Reasons To Not Enrol In A Coding Bootcamp.","spoiler":"There are some ugly parts that people don’t talk about. Before deciding to enrol, mind all the possible outcomes.","date":"2020-10-02T10:03:34.981Z"}}},"__N_SSG":true}