{"pageProps":{"post":{"slug":"quick-refactor-keep-casing-in-vscode-search-replace","content":"<h1>Quick Refactor: Keep Casing in VSCode Search + Replace</h1>\n<h2>A simple Visual Studio Code trick to save precious time while refactoring</h2>\n<h3>THE PROBLEM</h3>\n<p>We have a <code>pet</code> object, whose value under the key of <code>name</code> we are changing. We are saving a reference to the old value that the key <code>name</code> pointed to for logging purposes.</p>\n<p>Now we realize that we’d like to rename the key <code>name</code> to <code>alias</code>. A refactoring is in order. So we pull up the find and replace feature by pressing ctrl/cmd + f.</p>\n<p>But oops! as they key <code>name</code> is also used in camelCase as part of other variables names <code>newPetName</code> and <code>oldPetName</code> , we get a casing mismatch after replacing. <code>newPetalias</code> and <code>oldPetalias</code> don’t look so good…</p>\n<h3>A SOLUTION</h3>\n<p>We are going to undo this change and repeat it using the <a href=\"https://code.visualstudio.com/docs/editor/codebasics#_advanced-find-and-replace-options\">preserve case option on the find and replace feature</a> by pressing the <code>AB</code> button.</p>\n<p>Now we’ve saved time refactoring and our pets are happy with their aliases!</p>\n","frontmatter":{"title":"Quick Refactor: Keep Casing in VSCode Search + Replace","spoiler":"Learn how to preserve casing when refactoring variable names in VSCode search and replace.","date":"2021-03-28T15:50:52.785Z"}},"previous":{"slug":"a-snazzy-trick-how-to-style-your-console-log-messages","frontmatter":{"title":"A Snazzy Trick: How To Style Your console.log() Messages","spoiler":"A quick guide (with examples) on applying CSS to log messages in the browser’s console","date":"2021-03-25T13:59:01.112Z"}},"next":{"slug":"omonp-3-building-a-carousel-with-swiper","frontmatter":{"title":"Building a carousel with Swiper","spoiler":"Let’s build a touch-triggered image slider with lazy loading, navigation, and pagination, in one minute.","date":"2021-04-06T01:28:57.384Z"}}},"__N_SSG":true}